In [1]:
%matplotlib inline

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [20]:
import matplotlib.pyplot as plt

In [3]:
!cat ch06/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
df = pd.read_csv('ch06/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
df2 = pd.read_table('ch06/ex1.csv', sep=',')

In [8]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_csv('ch06/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('ch06/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names = ['a', 'b', 'c', 'd', 'message']

In [12]:
pd.read_csv('ch06/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [13]:
parsed = pd.read_csv('ch06/csv_mindex.csv', index_col=['key1', 'key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [15]:
list(open('ch06/ex3.txt'))

['        A     B     C\n',
 'aaa -0.26 -1.02 -0.61\n',
 'bbb  0.92  0.12  0.21\n',
 'ccc -0.11 -0.43  0.23\n',
 'ddd -0.81 -0.91  0.21\n']

In [16]:
result = pd.read_table('ch06/ex3.txt', sep='\s+')

In [19]:
result

        A     B     C
aaa -0.26 -1.02 -0.61
bbb  0.92  0.12  0.21
ccc -0.11 -0.43  0.23
ddd -0.81 -0.91  0.21

In [18]:
pd.read_csv('ch06/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   wolrd
2  9  10  11  12     foo

In [21]:
result = pd.read_csv('ch06/ex5.csv')

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [24]:
result = pd.read_csv('ch06/ex5.csv', na_values=['NULL'])

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
sentinels = {
    'message': {'foo', 'NA'},
    'something': ['two']
}

In [27]:
pd.read_csv('ch06/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [28]:
# 逐行读取文本

In [29]:
pd.read_csv('ch06/ex5.csv', nrows=2)

  something  a  b    c  d message
0       one  1  2  3.0  4     NaN
1       two  5  6  NaN  8   world

In [49]:
chunker = pd.read_csv('ch06/ex5.csv', chunksize=3)

In [50]:
chunker

In [51]:
tot = Series([])
for piece in chunker:
    tpt = tot.add(piece['a'].value_counts(), fill_value=0)

In [52]:
tot

Series([], dtype: float64)

In [53]:
# 将数据写出到文本格式

In [54]:
data = pd.read_csv('ch06/ex5.csv')

In [55]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [56]:
data.to_csv('ch06/ex6.csv')

In [57]:
import sys

In [58]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [60]:
data.to_csv(sys.stdout, na_rep='NUlL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NUlL
1,two,5,6,NUlL,8,world
2,three,9,10,11.0,12,foo

In [61]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [62]:
dates = pd.date_range('1/1/2000', periods=7)

In [63]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [64]:
ts = Series(np.arange(7), index=dates)

In [65]:
ts.to_csv('ch06/tseries.csv')

In [68]:
Series.from_csv('ch06/tseries.csv', parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [69]:
# 手工处理分隔符格式

In [70]:
import csv
f = open('ch06/ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [75]:
f = open('ch06/ex7.csv')
reader = csv.reader(f)
lines= list(reader)

In [76]:
print(lines)

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3', '4']]

In [77]:
header, values = lines[0], line[1:]

In [78]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [79]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [84]:
#class my_dialect(csv.Dialect):
#    lineterminator = '\n'
#    delimiter = ';'
    # quotechar = '"'
    
#reader = csv.reader(f, dialect=my_dialect)

In [91]:
# JSON数据
import json

In [89]:
obj = {
    'name': 'Wes',
    'places_lived': ['United States', 'Spain', 'Germany'],
    'pet': None,
    'siblings': [{'name': 'Scott', 'age': 25, 'pet': 'Zuka'},
                 {'name': 'Katie', 'age': 33, 'pet': 'Cisco'}]
}

In [90]:
obj

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuka'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [92]:
obj_str = json.dumps(obj, indent=2)

In [94]:
print(obj_str)

{
  "pet": null,
  "siblings": [
    {
      "pet": "Zuka",
      "age": 25,
      "name": "Scott"
    },
    {
      "pet": "Cisco",
      "age": 33,
      "name": "Katie"
    }
  ],
  "name": "Wes",
  "places_lived": [
    "United States",
    "Spain",
    "Germany"
  ]
}

In [95]:
siblings = DataFrame(obj['siblings'], columns=['name', 'age'])

In [96]:
siblings

    name  age
0  Scott   25
1  Katie   33